### Curar datos

Ahora veremos como arreglar problemas que se originan en el dataset, si abrimos el archivo _international-airline-passengers.csv_ veremos que no se respeto el formato de los datos y ahora trataremos de arreglar ese problema empezando por la linea de abajo la ultima linea no nos interesa asique usaremos el comando skipfooter y como argumento recivira el numero de columnas de la ultima fila que queremos saltar usaremos este comando

~~~python
data1 = pandas.read_csv('data.csv',engine='python',skipfooter=3)
~~~
**Notas**
Devemos pasar solo el nombre del archivo ya que pandas automaticamente reconoce los headers, y el argumento **engine** se especifica en la documentacion como un argumento para póder saltar el footer ya que no funciona bajo el motor de C y en este caso son 3 columnas de la ultima fila

In [1]:
import pandas as pd

df = pd.read_csv('data/international-airline-passengers.csv',engine='python',skipfooter=3)

In [2]:
df.columns

Index(['Month', 'International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60'], dtype='object')

Otra cosa que podemos notar esque el nombre las columnas se ve mal lo que podemos hacer es pasarle una lista

In [3]:
df.columns = ["Mes",'Pasajeros']

In [4]:
df.columns

Index(['Mes', 'Pasajeros'], dtype='object')

Ahora se ven mucho mejor. otra cosa que podemos hacer es seleccionar una columna pasando el nombre dentro de parentesis cuadrados

In [5]:
df["Pasajeros"].head(2)

0    112
1    118
Name: Pasajeros, dtype: int64

Pero hay otra forma mucho mas facil de accesar a las columnas que es hacerlo como si cada columna fuera un **metodo** del objeto **DataFrame**

In [6]:
df.Pasajeros.head(1)

0    112
Name: Pasajeros, dtype: int64

Esto se ve bello pero **no** va a funcionar si el nombre de la columna contiene espacios

por ultimo, veremos como añadir otra columna al **DataFrame**, cuando vemos machine learning devemos y hacemos algo con redes bayesianas devemos poner una columna de unos a los datos, veamos un ejemplo

In [7]:
df['unos'] = 1

In [8]:
df.head(5)

       Mes  Pasajeros  unos
0  1949-01        112     1
1  1949-02        118     1
2  1949-03        132     1
3  1949-04        129     1
4  1949-05        121     1

Ahora si queremos agregar una fila que tenga el resultado de una funcion  devemos usar el metodo **apply** de el objeto **DataFrame**, su sintaxis es la siguiente
~~~python
df['nuevaColumna'] = df.apply(funcion, axis=1)
~~~
la funcion puede ser cualquier funcion, incluso una funcion anonima, osea una funcion Lambda, pero puede ser cualquier tipo de funcion y respecto al argumento **axis**, es el eje, axis=0 son las columnas y axis=1 son las filas

![Axis](https://i.stack.imgur.com/DL0iQ.jpg)

Ahora veamos como se hace, vamos a convertir la fecha del dataset a un objeto DateTime

In [9]:
from datetime import datetime
df['dt'] = df.apply(lambda row: datetime.strptime(row['Mes'],'%Y-%m'),axis=1)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 4 columns):
Mes          144 non-null object
Pasajeros    144 non-null int64
unos         144 non-null int64
dt           144 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 4.6+ KB

In [11]:
#Forma 2
def tdt(row):
    res = datetime.strptime(row['Mes'],'%Y-%m')
    return res
df['dt2'] = df.apply(tdt, axis=1)

In [12]:
df.head()

       Mes  Pasajeros  unos         dt        dt2
0  1949-01        112     1 1949-01-01 1949-01-01
1  1949-02        118     1 1949-02-01 1949-02-01
2  1949-03        132     1 1949-03-01 1949-03-01
3  1949-04        129     1 1949-04-01 1949-04-01
4  1949-05        121     1 1949-05-01 1949-05-01